<!--suppress ALL -->
<template>
    <div class="protocol">
        <CustomHeader :title="title" :needReturn="true"/>
        <div :style="{'height': mainHeight + 'px'}" class="content">
            <p class="title">特别提示：</p>

            <p>
                您在使用安徽青松易购（以下简称“青松易购”）及关联公司提供的各项服务之前，请您务必审慎阅读、充分理解本协议各条款内容，特别是以粗体下划线标注的部分，包括但不限于免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体
                标识，您应重点阅读。
            </p>
            <p> 如您不同意本服务协议及/或随时对其的修改，您应立即停止注册；您一旦使用青松易购提供的服务，即视为您已了解并完全同意本服务协议各项内容，包括青松易购对服务协议所做的修改，并成为我们的用户。
            </p>
            <p class="title"> 一、帐号注册
            </p>
            <p> 1、当您注册成功账号并且与某个青松易购提供技术支持的店铺发生行为关联时（包括不限于获得店铺优惠券、登录商家店铺后台、产生购买行为），您授权该商家获得您的手机帐号及青松易购账号信息以方便下单购买。
            </p>
            <p> 2、当您选择通过第三方授权登录程序进入青松易购，您需授权青松易购收集您的账号昵称及头像等标识化的个人信息，授权完成后，您即成为青松易购的“用户”。
            </p>
            <p> 3、当您按照注册页面提示填写信息并注册成功后，您即成为青松易购的“用户”；青松易购将给予您一个用户账号，该账号由您授权登录。登录后您应当对您在青松易购进行的活动和事件负法律责任。
            </p>
            <p> 4、本协议服务条款和公告可由青松易购定时更新，并按照法定流程进行公示。您在使用相关服务时,应关注并遵守其所适用的相关条款。
            </p>
            <p> 5、使用同一身份认证信息、同一手机号或经青松易购排查认定多个青松易购账户的实际控制人为同一人的，均视为同一用户。
            </p>
            <p>
                6、您确认，在您开始使用本服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您需要在您监护人的陪同下完成注册，并且您与您的监护人应依照法律规定承担因此而导致的一切后果。
            </p>
            <p class="title"> 二、注册信息
            </p>
            <p>
                1、您账号的所有权青松易购，使用权归您。您按注册页面引导填写信息，阅读并同意本协议且完成全部注册程序后，即可获得注账号并成为用户。您应提供及时、详尽及准确的个人资料，并不断更新注册资料。所有原始键入的资料将引用为注册资料。如果因注册信息不真实或更新不及时而引发的相关问题，由您自行承担相应的责任。
            </p>
            <p>
                2、您应当通过真实身份信息认证注册账号，且您提交的账号名称、头像、简介等注册信息中不得出现违法和不良信息，经平台审核，如存在上述情况，青松易购将不予注册；同时，在注册后，如发现您以虚假信息骗取账号名称注册，或其账号头像、简介等注册信息存在违法和不良信息的，青松易购有权单方采取限期改正、暂停使用、注销登记、收回等措施。
            </p>
            <p> 3、您账号包括账户名称和手机号，账户名称作为您有效的身份凭证之一。您可使用手机号和短信验证码登录或授权第三方平台直接登录。
            </p>
            <p>
                4、因您个人原因导致的账号信息遗失，如需找回账号信息，请按照账号找回要求提供相应的信息，并确保提供的信息合法真实有效，若提供的信息不符合要求，无法通过安全验证，青松易购有权拒绝提供账号找回服务；若账号的唯一凭证不再有效，青松易购有权拒绝支持账号找回。例如手机号二次出售，青松易购可拒绝支持帮助找回原手机号绑定的帐号。
            </p>
            <p> 5、在需要终止使用账号服务时，同时符合以下条件的，您可以申请注销您的账号：
            </p>
            <p> （1）您仅能申请注销您本人的账号，并依照青松易购的流程进行注销；
            </p>
            <p> （2）您在注册时享有相应的行为能力及责任能力；
            </p>
            <p> （3）您仍应对您在注销账号前的使用行为承担相应责任，同时青松易购仍可保存您注销前的相关信息；
            </p>
            <p> （4）注销成功后，账号信息、个人身份信息、交易记录、会员权益等将无法恢复或提供。
            </p>
            <p>
                6、当您使用青松易购产品进行支付、登录等操作的时候，服务器会自动接收、验证、并记录一些必要的信息，如手机号码、IP地址、服务访问异常信息、以及部分设备信息等，以保障您在使用服务时账户登录和支付过程的安全，进而保护您的上网安全。您使用青松易购的服务，即表示您同意青松易购可以按照《隐私政策》处理您的个人信息。青松易购可能会与合作伙伴共同向您提供您所要求的服务或者共同向您展示您可能感兴趣的内容。在信息为该项产品/服务所必须的情况下，您同意青松易购可与其分享必要的信息。并且，青松易购会要求其确保数据安全并且禁止用于任何其他用途。除此之外，青松易购不会向任何无关第三方提供或分享信息。
            </p>
            <p> 7、您知悉并授权，青松易购仅在必需的情况下使用或与关联公司同步您的信息，以为您提供更好的服务。
            </p>
            <p> 8、为更好地向您提供服务，您同意青松易购通过短信、app通知等形式向您发送相关商业性服务信息。
            </p>
            <p class="title"> 三、使用规则
            </p>
            <p> 1、您确认，当您注册成功并且与某个店铺发生行为关联时，如您获得商家的优惠券、登录商家店铺后台、产生购买行为等，您确认并授权青松易购提供技术支持的店铺获得您的手机号，以方便您的购买。
            </p>
            <p> 2、您在使用青松易购提供的服务时，必须遵守中华人民共和国相关法律法规的规定，您应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为:
            </p>
            <p> （1）您设置的会员名、上传或发布的信息不得含有下列内容之一的信息：
            </p>
            <p> 　　① 违反宪法所确定的基本原则的；
            </p>
            <p> 　　② 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            </p>
            <p> 　　③ 损害国家荣誉和利益的；
            </p>
            <p> 　　④ 煽动民族仇恨、民族歧视、破坏民族团结的；
            </p>
            <p> 　　⑤ 破坏国家宗教政策，宣扬邪教和封建迷信的；
            </p>
            <p> 　　⑥ 散布谣言，扰乱社会秩序，破坏社会稳定的；
            </p>
            <p> 　　⑦ 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            </p>
            <p> 　　⑧ 侮辱或者诽谤他人，侵害他人合法权利的；
            </p>
            <p> 　　⑨ 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
            </p>
            <p> 　　⑩ 侵害第三方合法权益的文件、文章、图片、音乐、视频、应用等，包括但不限于病毒代码、黑客程序、软件破解注册信息等；
            </p>
            <p> ⑪含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
            </p>
            <p> ⑫违反青松易购信息发布政策或损害青松易购合法权益的。
            </p>
            <p> （2）不得为任何非法目的而使用青松易购服务系统；
            </p>
            <p> （3）不利用青松易购的服务从事以下活动：
            </p>
            <p> 　　① 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
            </p>
            <p> 　　② 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
            </p>
            <p> 　　③ 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
            </p>
            <p> 　　④ 故意制作、传播计算机病毒等破坏性程序的；
            </p>
            <p> 　　⑤ 其他危害计算机信息网络安全的行为。
            </p>
            <p> 您应保证自身对账号使用行为的合法性、正当性，且不得对客户端进行反编译、反汇编、破解等行为。
            </p>
            <p>
                3、您违反本协议或相关服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括但不限于合理的律师费、诉讼费等，您同意赔偿青松易购与合作公司、关联公司，并使之免受损害。对此，青松易购有权视您的行为性质，采取包括但不限于删除您发布信息内容、暂停使用许可、终止服务、限制使用、回收账号、追究法律责任等措施。
            </p>
            <p> 对恶意注册账号或利用账号进行违法活动、捣乱、骚扰、欺骗其他用户以及其他违反本协议行为的，青松易购有权回收其账号。同时，青松易购会视司法部门的要求，协助调查。
            </p>
            <p>
                4、您需要对自己在服务使用过程中的行为负法律责任，即使您已经终止使用该服务。您承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在青松易购首先承担了因您的行为导致的行政处罚或侵权损害赔偿责任后，您应给予青松易购等额的赔偿。
            </p>
            <p> 5、青松易购有权根据认定程序及标准判断您账户的使用情况，对于可能危及您的账户安全及/或青松易购平台信息安全的，青松易购可拒绝提供相应服务或终止本协议。
            </p>
            <p class="title"> 四、服务内容
            </p>
            <p> 1、您在交易过程中与其他用户发生争议的，您或其他用户中任何一方可以自行协商解决，也可以通过青松易购介入处理，若您觉得以上的方式均无法达到您要的结果，您可以寻求司法机关的协助。
            </p>
            <p> 2、若您选择青松易购介入的方式处理相关问题，请您遵守和执行青松易购的处理结果,青松易购对该处理结果不承担法律责任。若您对青松易购的处理结果不满意，您可以寻求其他途径解决纠纷例如起诉、仲裁等方式。
            </p>
            <p>
                3、青松易购目前为您提供免费服务，但保留因业务调整或者其他法律法规要求向您收取费用的权利。在提供收费服务前，青松易购会向您给予明确提示，只有在您根据提示指示选择同意支付相关费用后，青松易购才会向您提供该等收费服务。如果您拒绝支付相关费用，青松易购有权不向您提供该等收费服务。
            </p>
            <p> 4、青松易购网络服务的具体内容由青松易购根据实际情况提供。除非另有明确约定，青松易购增强或强化目前服务功能的所有新功能，包括新的产品以及新的服务，均自动适用本协议及相关协议的约定。
            </p>
            <p> 5、鉴于网络服务的特殊性，您同意青松易购有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。标注不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
            </p>
            <p> 6、终止服务
            </p>
            <p>
                您同意青松易购得基于其自行之考虑，因任何理由，或青松易购认为您已经违反本服务协议的文字及精神，终止您账号或本服务的使用（或服务的任何部分），并将您在本服务内全部或部分内容加以移除并删除。您同意依本用户协议规定提供的商品或服务，无需进行事先通知即可中断或终止。您承认并同意，青松易购可立即关闭或删除您的账号及您账号中所有相关信息及文件，及禁止继续使用前述文件或本服务。此外，您同意若本服务的使用被中断、终止或您的账号及相关信息和文件被关闭或删除，青松易购对您或任何第三人均不承担任何责任。
            </p>
            <p class="title"> 五、个人数据授权与保护
            </p>
            <p> 1、为了保护您的财产及信息安全，预防诈骗或者其他网络犯罪行为，有权收集您的个人信息，包括但不限于个人会员信息、交易信息来判断您个人的交易风险，对您身份进行验证等。
            </p>
            <p> 2、根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：
            </p>
            <p> （1）根据法律法规的规定或行政、司法机构等有权机关的要求或者授权；
            </p>
            <p> （2）与公共安全、公共卫生、重大公共利益有关的；
            </p>
            <p> （3）您出现违反适用法律、法规规定或者违反您与我们签署的相关协议（包括在线签署的电子协议）或相关规则时需要向第三方披露的情形
            </p>
            <p>
                （4）我们与第三方进行联合营销活动，我们可能与其共享活动过程中产生的、为完成活动所必要的个人信息，如参加活动的用户数、中奖名单、中奖人联系方式等，以便第三方能及时向您发放奖品。如与授权合作伙伴共享，仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，在您使用我们配送服务时，我们必须与物流服务提供商共享您的个人信息才能安排送货，或者安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途；
            </p>
            <p> （5）为维护我们及关联方或其他我们用户的合法权益但又很难得到本人同意的；
            </p>
            <p> （6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
            </p>
            <p>
                （7）出于实现本政策公示的我们如何使用您的个人信息的目的，或为履行我们和您签订的协议中或本隐私政策中的义务和行使我们的权利，向我们的关联方、合作伙伴或代表我们履行某项职能的第三方（例如处理银行卡的支付机构等）分享您的个人信息。
            </p>
            <p> （8）法律法规规定的其他情形。
            </p>
            <p> 3、我们已采取符合业界标准、合理可行的安全防护措施保护您提供的个人信息安全，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。
            </p>
            <p class="title"> 六、免责声明
            </p>
            <p> 因以下情况造成网络服务在合理时间内中断的，青松易购无需为此承担任何责任；
            </p>
            <p> （1）青松易购需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，青松易购保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。
            </p>
            <p> （2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；
            </p>
            <p> （3）您的电脑软硬件和通信线路、供电线路出现故障的；
            </p>
            <p> （4）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因。
            </p>
            <p> 尽管有前款约定，青松易购将采取合理行动积极促使服务恢复正常。
            </p>
            <p class="title"> 七、知识产权和其他合法权益
            </p>
            <p>
                1、青松易购产品及相关网站上由青松易购上传、制作、拥有的所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由青松易购或其关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。但如因您上传的由其自行制作、拥有的内容涉及侵犯青松易购或其他任何第三方的合法权益的，您应自行对其侵权行为产生的纠纷进行处理，并对其侵权行为承担法律责任，且就由此给青松易购造成的损失（包括但不限于青松易购声誉的影响、青松易购由此承担的连带责任（如有）等）进行赔偿。
            </p>
            <p>
                2、非经青松易购或其关联公司书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表在本网站上程序或内容（仅限于由青松易购上传、制作、拥有的所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计等）；如您需使用著作权非青松易购所有的内容的，您应获得具体内容的著作权所有者的合法授权才能使用，如因您私自使用非自己所有的、且未经他人合法授权的著作、图片、档案、资讯、资料等内容的，由您自行承担责任，包括但不限于您自行对其侵权行为产生的纠纷进行处理，并对其侵权行为承担法律责任，且就由此给青松易购造成的损失（包括但不限于青松易购声誉的影响、青松易购由此承担的连带责任（如有）等）进行赔偿。
            </p>
            <p> 3、尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。
            </p>
            <p class="title"> 八、其他
            </p>
            <p> 1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。
            </p>
            <p> 2、 如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余条款则仍具有法律效力。
            </p>
            <p> 3、本协议任何一方于另一方过失或违约时放弃本协议规定的权利的，不得视为其对一方的其他或以后同类之过失或违约行为弃权。
            </p>
            <p> 4、青松易购未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。
            </p>
            <p> 5、本协议最终解释权及修订权在法律范围内归青松易购所有。
            </p>
            <p> 6、您因使用青松易购服务产生的争议，由青松易购与您协商解决。协商不成时，任何一方均可向被告所在地人民法院提起诉讼。
            </p>
            <p> 您均已认真阅读协议中全部条款及相关操作规则的内容，对协议及前述服务条款和规则均已知晓、理解并接受，同意将其作为确定双方权利义务的依据
            </p>

        </div>
    </div>
</template>

<script>
    import CustomHeader from '../../../components/CustomHeader';

    export default {
        name: 'index',
        components: {
            CustomHeader
        },
        computed: {
            statusBarHeight () {
                return this.model.global.barHeight.statusBarHeight
            },
            navHeight () {
                return this.model.global.barHeight.navHeight
            },
            mainHeight() {
                let systemInfo = wx.getSystemInfoSync();
                let height = systemInfo.windowHeight;
                return height - this.navHeight - this.statusBarHeight;
            },
        },
        data () {
            return {
                title: '用户协议'
            }
        }
    }
</script>

<style scoped>
    .content{
        box-sizing: border-box;
        width: 100%;
        padding: 20px;
        overflow: auto;
    }
    .content p{
        font-size: 28rpx;
        color: #333;
    }

    .content .title{
        font-size: 32rpx;
        font-weight: bold;
        margin-top: 20rpx;
        margin-bottom: 10rpx;
        color: #111;
    }
</style>
