<!--suppress ALL -->
<template>
    <div>
        <CustomHeader :title="title" :needReturn="true" />
        <div class="content" :style="{'height': mainHeight + 'px'}">
            <p>            欢迎您（用户）使用青松易购自提服务,您在使用青松易购自提服务前,请仔细认真阅读、理解《用户自提服务协议》(以下简称“本协议”)的内容。本协议是您与青松易购之间就青松易购提供的到店自取服务等相关事宜所订立的协议,是《青松易购用户协议》的必要组成部分。请您仔细阅读本协议,您勾选“同意《用户自提服务协议》”并创建订单使用服务后,本协议对您产生约束力。您应当在使用青松易购平台的服务之前认真阅读、充分理解全部条款的内容,如您对条款有任何疑问,应向平台客服咨询。
            </p>
            <p class="title">            一、定义
            </p>
            <p>            1、青松易购:青松合伙人、青松易购小程序等,以上统称为青松易购平台。
            </p>
            <p>            2、用户:即本协议中的“您”,是指在青松易购平台中,到店自取订单的消费者。
            </p>
            <p>            3、自取:是指用户在青松易购平台上购买商品后,将在平台规定的时间内根据平台显示的地址到店取货的行为。
            </p>
            <p class="title">            二、协议的确认和接受
            </p>
            <p>            1、在您使用青松易购平台服务之前认真阅读协议全部条款内容。如您对本协议有任何疑问的,应联系客服咨询,如不同意,您有权拒绝使用平台提供的服务。一旦您使用青松易购平台提供的服务,即表示您已充分阅读、理解并接受本协议的全部内容,协议即对您产生约束力。届时您不应以未阅读(理解或同意)协议的内容为由,主张协议无效,或要求撤销协议。
            </p>
            <p>            2、本协议内容包括协议正文及所有青松易购已经发布的或将来可能发布的各类规则,所有规则为本协议不可分割的组成部分,与本协议正文具有同等法律效力。您承诺接受并遵守本协议的约定,如果不同意本协议的约定,您应立即停止使用青松易购的服务。
            </p>
            <p class="title">            三、青松易购平台提供的服务
            </p>
            <p>            1、用户可以通过青松易购平台下自提订单。
            </p>
            <p>            2、青松易购根据用户提交的订单信息，包括自提电话、自提时间、订单商品等，生成自提订单，并提醒用户根据相应的订单信息及时前往相应的自提点自提。
            </p>
            <p>            3、青松易购保留在后续运营过程中收取用户平台服务费的权利，如收费，以本平台实际展示为准。
            </p>
            <p>            4、青松易购的客服电话可受理用户投诉，青松易购对投诉会及时处理。
            </p>
            <p>            5、自提服务只能为已开通自提服务城市的用户提供服务，具体以平台实际提供的服务为准。
            </p>
            <p class="title">            四、用户权利义务
            </p>
            <p>            1、用户通过青松易购平台到店自取订单，并在支付成功后可通过用户手机终端实时查看订单状态。
            </p>
            <p>            2、由于市场变化及各种商业难以控制因素的影响，在特殊情况下，用户付款之后也会存在库存不足，以及不可抗力等原因导致履约问题出现。如果发生这种情况，用户或青松易购平台可对订单进行售后处理。
            </p>
            <p>            3、用户保证，通过青松易购平台自提订单时应合理预约自提时间并填写有效的联系方式，且在预约的自提时间范围内，准时前往站点自提。如用户迟到或早到导致的责任，包括但不限于等待、商品丢失、商品品质及质量下降、订单不退款等，由用户自行承担。
            </p>
            <p>            特别提示：由于鲜品、主食等保质期较短商品无法为您保留较长时间，因此您若未按下单时规定时间内取货，则将视为您主动放弃商品，平台将做处理。
            </p>
            <p>            取货有效时间：订单到货后1天内可取。超过1天未取，订单状态将变成“已过期”，平台将对已过期订单的商品进行报损及相关处理。
            </p>
            <p>            4、为保障用户的权益，用户到达自取门店后，应当场核对商品，核对范围包括但不限于：商品种类、规格、数量（包括商品最小包装单位）、金额、赠品、外包装等是否与订单一致，鲜品、主食的外观是否有变化等。根据不同商品的不同属性，在验货时用户还需要一并检查以下内容，包括但不限于：商品表面质量问题、商品包装、商品本身标识等。如用户在验货时发现商品存在前述问题，用户可以拒收问题商品，由平台做缺货或退款处理。
            </p>
            <p>            5、用户应当严格遵守本协议及青松易购发布的其他规则、须知或协议，因用户违反本协议或其他规则、须知或协议的行为给第三方或给青松易购造成损失的，用户应当承担赔偿责任。
            </p>
            <p class="title">            五、商品信息
            </p>
            <p>            青松易购平台上的商品价格、数量、是否有货等商品信息随时都有可能发生变动，青松易购不作特别通知。我们会尽最大努力保证用户所浏览商品信息的准确性，但由于互联网技术因素等客观原因存在，青松易购平台上显示的信息可能会有一定的滞后性或差错，对此情形用户知悉并理解。
            </p>
            <p class="title">            六、责任范围与责任限制
            </p>
            <p>            1、用户需确认，您在实际使用青松易购的服务时，应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果，青松易购有权注销您的账户或停止向您提供服务。
            </p>
            <p>            2、用户在青松易购注册成功后，将产生账户信息，您可以根据青松易购的规则改变您的账户。用户应谨慎合理的保存、使用其用账户。用户若发现任何不当使用用户账号或存在安全漏洞等其他可能危及用户账户安全的情况，应当立即以有效方式通知青松易购，要求青松易购暂停相关服务，情况严重的，可向公安机关报案。您理解青松易购对您的请求采取行动需要合理时间，青松易购对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。用户不得将青松易购账户借（租）给他人使用，否则用户应承担由此产生的全部责任。
            </p>
            <p>            3、用户同意自行承担使用网络服务的风险，青松易购不做任何类型的担保，包括但不限于：不担保服务一定能满足用户的要求；不担保服务不会受中断，对服务的及时性，安全性，出错发生不担保；对在青松易购上以及第三方合作得到的任何服务或交易进程，不作担保；对平台服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、稳定性、完整性和及时性不作出任何承诺和保证；不担保平台服务的适用性没有错误或疏漏。
            </p>
            <p>            4、用户同意并确认，青松易购拥有独自决定拒绝服务、关闭用户账户或取消任务事项的权利。
            </p>
            <p>            5、用户在通过青松易购进行在线下订单等活动时，涉及用户真实姓名/名称、履行地址、联系电话等隐私信息的，青松易购将予以严格保密，除非得到用户的授权或法律法规、本协议及相关协议另有规（约）定外，青松易购不会向外界披露用户隐私信息。
            </p>
            <p>            6、用户同意青松易购可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与青松易购同等的保护用户隐私的责任，则青松易购有权将用户的信息资料等提供给该第三方。另外，在不透露单个用户隐私资料的前提下，青松易购有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
            </p>
            <p>            7、用户在青松易购平台上的评价或评分等信息都将作为青松易购的数据财产，青松易购有权予以展示、汇编及其他合理使用。用户接受本协议即表明您将在青松易购发表的任何形式的信息的著作权或其他合法权利，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权等以及应当由著作权人享有的其他可转让权利无偿独家转让给青松易购所有，同时表明用户许可青松易购有权就任何主体侵权而单独提起诉讼，并获得全部赔偿。
            </p>
            <p>            8、用户同意青松易购拥有通过消息推送、平台公示、短信、电话、邮件等形式向您告知与本协议相关服务信息的权利，用户允许平台向其发送上述电子信息。
            </p>
            <p class="title">            七、协议更新及用户关注义务
            </p>
            <p>            根据国家法律法规变化及平台运营需要，青松易购有权对本协议条款不时地进行修改，修改后的协议一旦在平台公示即生效，并代替原来的协议。用户可随时登录查阅最新协议；用户有义务不时关注并阅读最新版的协议及平台公告。如用户不同意更新后的协议，应立即停止接受依据本协议提供的服务。青松易购提示用户在使用平台之前阅读本协议及公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
            </p>
            <p class="title">            八、违约责任：
            </p>
            <p>            1、除本协议及商城规则另有约定之外，如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，并就违约行为造成的损失进行索赔，如违约方未能按时停止违约行为，则守约方有权立即终止本协议。
            </p>
            <p>            2、因不可抗力或其他意外事件，使得协议不能履行的，双方均不承担违约责任；协议称不可抗力包括但不限于战争、台风、水灾、地震、罢工、暴动、法定流行疾病、黑客攻击、网络病毒、电信部门技术管制、互联网联通中断、系统故障、政府行为或其他自然或人为灾难等客观情况。
            </p>
            <p class="title">            九、协议终止
            </p>
            <p>            在下列情况下，青松易购可以终止服务，同时保留对用户的违法和/或违约行为追究法律责任的权利：
            </p>
            <p>            （1）用户违反法律法规及本协议相关条款规定；
            </p>
            <p>            （2）本协议条款更新时，用户明示不愿接受新的条款；
            </p>
            <p>            （3）用户对本平台实施恶意攻击等行为；
            </p>
            <p>            （4）本平台认为需要终止服务的其他情况。
            </p>
            <p class="title">            十、法律管辖和适用
            </p>
            <p>            本协议之解释与适用，以及与本协议有关的争议，应协商解决，协商不成，应向被告所在地人民法院提起诉讼。
            </p>
            <p class="title">            十一、其他
            </p>
            <p>            1、用户签署或点击青松易购平台“同意并继续”按钮，即视为用户完全接受本协议，在点击之前请用户再次确认已知悉并完全理解本协议的全部内容。
            </p>
            <p>            2、以上事项请用户知悉并了解，因未按照本协议内容进行操作给用户造成损失的，该损失由用户自行承担。
            </p>
        </div>
    </div>
</template>

<script>
    import CustomHeader from '../../../components/CustomHeader';
	export default {
		name: 'index',
        components: {
            CustomHeader
        },
        computed: {
            statusBarHeight () {
                return this.model.global.barHeight.statusBarHeight
            },
            navHeight () {
                return this.model.global.barHeight.navHeight
            },
            mainHeight() {
                let systemInfo = wx.getSystemInfoSync();
                let height = systemInfo.windowHeight;
                return height - this.navHeight - this.statusBarHeight;
            },
        },
        data () {
            return {
                title: '用户自提协议'
            }
        }
	}
</script>

<style scoped>
    .content{
        box-sizing: border-box;
        width: 100%;
        padding: 20px;
        overflow: auto;
    }
    .content p{
        font-size: 28rpx;
        color: #333;
    }

    .content .title{
        font-size: 32rpx;
        font-weight: bold;
        margin-top: 20rpx;
        margin-bottom: 10rpx;
        color: #111;
    }
</style>
